$(function () {
  let arr = ['北京', '大连', '上海', '济南', '广州', '金华', '武汉', '南京', '深圳', '天津', '成都', '长春', '杭州', '宁波', '青岛', '沈阳', '广东'];
  let id="aaa";
  let name="搜索:"
  let obj={seArr:['北京', '大连', '上海', '济南', '广州', '金华', '武汉', '南京', '深圳', '天津', '成都', '长春', '杭州', '宁波', '青岛', '沈阳', '广东'],
    id:"aaa",
    name:"搜索"
  }
  let obj2={seArr:['北京', '大连', '上海', '济南', '广州', '金华', '武汉', '南京', '深圳', '天津', '成都', '长春', '杭州', '宁波', '青岛', '沈阳', '广东'],
    id:"bbb",
    name:"搜索:"
  }
  let obj3={seArr:['北京', '大连', '上海', '济南', '广州', '金华', '武汉', '南京', '深圳', '天津', '成都', '长春', '杭州', '宁波', '青岛', '沈阳', '广东'],
    id:"ccc",
    name:"搜索:"
  }
  let value = select(obj);
  // console.log(value);
  // select(obj2);
  // select(obj3);
})
